{
  "</box>": 151677,
  "</img>": 151670,
  "</quad>": 151673,
  "</ref>": 151675,
  "</think>": 151668,
  "</tool_call>": 151658,
  "</tool_response>": 151666,
  "<IMG_CONTEXT>": 151671,
  "<box>": 151676,
  "<img>": 151669,
  "<quad>": 151672,
  "<ref>": 151674,
  "<think>": 151667,
  "<tool_call>": 151657,
  "<tool_response>": 151665,
  "<video>": 151678,
  "<|box_end|>": 151649,
  "<|box_start|>": 151648,
  "<|endoftext|>": 151643,
  "<|file_sep|>": 151664,
  "<|fim_middle|>": 151660,
  "<|fim_pad|>": 151662,
  "<|fim_prefix|>": 151659,
  "<|fim_suffix|>": 151661,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644,
  "<|image_pad|>": 151655,
  "<|object_ref_end|>": 151647,
  "<|object_ref_start|>": 151646,
  "<|quad_end|>": 151651,
  "<|quad_start|>": 151650,
  "<|repo_name|>": 151663,
  "<|video_pad|>": 151656,
  "<|vision_end|>": 151653,
  "<|vision_pad|>": 151654,
  "<|vision_start|>": 151652
}
